_org/_posts/devenv/2019-03-01-ruby-setup.org
#+begin_export html
---
layout: post
title: "Ruby 安装配置"
date: 2017-07-27
categories: 研发环境
tags:
    - Ruby
    - rbenv
excerpt:
keywords: ""
---
#+end_export

* 安装 rbenv

#+begin_src shell
# 安装 rbenv
git clone https://github.com/sstephenson/rbenv.git ~/.rbenv
source ~/.bash_profile
# 确认 rbenv 的版本
rbenv -v
# 更新 rbenv
cd "$(rbenv root)" && git pull

# 配置 rbenv
# 然后把下面的代码放到 ~/.bash_profile 里
export PATH="$HOME/.rbenv/bin:$PATH"
eval "$(rbenv init -)"
# 注意：Unubtu 请放到 ~/.bashrc 里, zsh 用户是 ~/.zshrc
# 执行配置
source ~/.bash_profile
# 或者重开一个终端
#+end_src

* 安装插件

#+begin_src shell
# 安装插件 ruby-build
# 通常安装 ruby 最新版需要安装 ruby-build 插件用来编译安装 ruby
mkdir -p "$(rbenv root)"/plugins
git clone https://github.com/rbenv/ruby-build.git "$(rbenv root)"/plugins/ruby-build
# 普通用户不能监听 1024 以下端口，需要 sudo 授权
git clone https://github.com/dcarley/rbenv-sudo.git "$(rbenv root)"/plugins/rbenv-sudo
# 更新插件 ruby-build
cd "$(rbenv root)"/plugins/ruby-build && git pull
cd "$(rbenv root)"/plugins/rbenv-sudo && git pull

# 安装插件 rbenv-gemset
# 用来管理 gemset, 可选, 因为有 bundler 也没什么必要
git clone git://github.com/jamis/rbenv-gemset.git  "$(rbenv root)"/plugins/rbenv-gemset

# 安装插件 rbenv-update
# 通过 rbenv update 命令来更新 rbenv 以及所有插件, 推荐
git clone git://github.com/rkh/rbenv-update.git "$(rbenv root)"/plugins/rbenv-update

# 安装插件 rbenv-china-mirror
# 使用 Ruby China 的镜像安装 Ruby, 国内用户推荐
git clone git://github.com/AndorChen/rbenv-china-mirror.git "$(rbenv root)"/plugins/rbenv-china-mirror
#+end_src

* 安装 ruby

#+begin_src shell
rbenv install --list         # 列出所有 ruby 版本
rbenv install 1.9.3-p392     # 安装 1.9.3-p392
rbenv install jruby-1.7.3    # 安装 jruby-1.7.3
# 解决无法在 irb 中输入中文的方法
RUBY_CONFIGURE_OPTS="--with-readline-dir=/usr/lib" rbenv install 2.5.0
# 列出版本
rbenv versions               # 列出安装的版本
rbenv version                # 列出正在使用的版本

# 设置版本
# rbenv 支持以下三种 Ruby 版本的环境管理：
# global：设置全局的 Ruby 版本，换句话说，所有的 shell 都将使用该 Ruby 版本。
# local：为本地的一个特定项目设置 Ruby 版本，注意这将覆盖全局设置。
# shell：针对 shell 设置 Ruby 版本，该设置将覆盖 global 和 local 设置。

rbenv global 1.9.3-p392      # 默认使用 1.9.3-p392
# rbenv shell 1.9.3-p392       # 当前的 shell 使用 1.9.3-p392, 会设置一个 `RBENV_VERSION` 环境变量
# rbenv local jruby-1.7.3      # 当前目录使用 jruby-1.7.3, 会生成一个 `.rbenv-version` 文件

# ruby 配置
$XCFG/lang/ruby/linkruby.sh

# 安装插件
gem update --system
gem install bundler
gem install rails
#+end_src
