_posts/devenv/2017-07-27-ruby-setup.html
---
layout: post
title: "Ruby 安装配置"
date: 2017-07-27
categories: 研发环境
tags:
    - Ruby
    - RbEnv
---

<div id="outline-container-org06311f9" class="outline-2">
<h2 id="org06311f9"><span class="section-number-2">1</span> 安装 rbenv</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; rbenv</span>
git clone https://github.com/sstephenson/rbenv.git ~/.rbenv
<span style="color: #4f97d7;">source</span> ~/.bash_profile
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#30830;&#35748; rbenv &#30340;&#29256;&#26412;</span>
rbenv -v
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#26032; rbenv</span>
<span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(rbenv root)"</span> &amp;&amp; git pull

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#37197;&#32622; rbenv</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28982;&#21518;&#25226;&#19979;&#38754;&#30340;&#20195;&#30721;&#25918;&#21040; ~/.bash_profile &#37324;</span>
<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">PATH</span>=<span style="color: #2d9574;">"$HOME/.rbenv/bin:$PATH"</span>
<span style="color: #4f97d7;">eval</span> <span style="color: #2d9574;">"$(rbenv init -)"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27880;&#24847;&#65306;Unubtu &#35831;&#25918;&#21040; ~/.bashrc &#37324;, zsh &#29992;&#25143;&#26159; ~/.zshrc</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25191;&#34892;&#37197;&#32622;</span>
<span style="color: #4f97d7;">source</span> ~/.bash_profile
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25110;&#32773;&#37325;&#24320;&#19968;&#20010;&#32456;&#31471;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f6a870" class="outline-2">
<h2 id="org0f6a870"><span class="section-number-2">2</span> 安装插件</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#25554;&#20214; ruby-build</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36890;&#24120;&#23433;&#35013; ruby &#26368;&#26032;&#29256;&#38656;&#35201;&#23433;&#35013; ruby-build &#25554;&#20214;&#29992;&#26469;&#32534;&#35793;&#23433;&#35013; ruby</span>
mkdir -p <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins
git clone https://github.com/rbenv/ruby-build.git <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/ruby-build
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26222;&#36890;&#29992;&#25143;&#19981;&#33021;&#30417;&#21548; 1024 &#20197;&#19979;&#31471;&#21475;&#65292;&#38656;&#35201; sudo &#25480;&#26435;</span>
git clone https://github.com/dcarley/rbenv-sudo.git <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/rbenv-sudo
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#26032;&#25554;&#20214; ruby-build</span>
<span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/ruby-build &amp;&amp; git pull
<span style="color: #4f97d7;">cd</span> <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/rbenv-sudo &amp;&amp; git pull

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#25554;&#20214; rbenv-gemset</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#29992;&#26469;&#31649;&#29702; gemset, &#21487;&#36873;, &#22240;&#20026;&#26377; bundler &#20063;&#27809;&#20160;&#20040;&#24517;&#35201;</span>
git clone git://github.com/jamis/rbenv-gemset.git  <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/rbenv-gemset

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#25554;&#20214; rbenv-update</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36890;&#36807; rbenv update &#21629;&#20196;&#26469;&#26356;&#26032; rbenv &#20197;&#21450;&#25152;&#26377;&#25554;&#20214;, &#25512;&#33616;</span>
git clone git://github.com/rkh/rbenv-update.git <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/rbenv-update

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#25554;&#20214; rbenv-china-mirror</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992; Ruby China &#30340;&#38236;&#20687;&#23433;&#35013; Ruby, &#22269;&#20869;&#29992;&#25143;&#25512;&#33616;</span>
git clone git://github.com/AndorChen/rbenv-china-mirror.git <span style="color: #2d9574;">"$(rbenv root)"</span>/plugins/rbenv-china-mirror
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb83edc" class="outline-2">
<h2 id="orgdb83edc"><span class="section-number-2">3</span> 安装 ruby</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">rbenv install --list         <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21015;&#20986;&#25152;&#26377; ruby &#29256;&#26412;</span>
rbenv install <span style="color: #a45bad;">1.9.3-p392</span>     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; 1.9.3-p392</span>
rbenv install jruby-1.7.3    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; jruby-1.7.3</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35299;&#20915;&#26080;&#27861;&#22312; irb &#20013;&#36755;&#20837;&#20013;&#25991;&#30340;&#26041;&#27861;</span>
<span style="color: #7590db;">RUBY_CONFIGURE_OPTS</span>=<span style="color: #2d9574;">"--with-readline-dir=/usr/lib"</span> rbenv install <span style="color: #a45bad;">2.5.0</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21015;&#20986;&#29256;&#26412;</span>
rbenv versions               <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21015;&#20986;&#23433;&#35013;&#30340;&#29256;&#26412;</span>
rbenv version                <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21015;&#20986;&#27491;&#22312;&#20351;&#29992;&#30340;&#29256;&#26412;</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#32622;&#29256;&#26412;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rbenv &#25903;&#25345;&#20197;&#19979;&#19977;&#31181; Ruby &#29256;&#26412;&#30340;&#29615;&#22659;&#31649;&#29702;&#65306;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">global&#65306;&#35774;&#32622;&#20840;&#23616;&#30340; Ruby &#29256;&#26412;&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#25152;&#26377;&#30340; shell &#37117;&#23558;&#20351;&#29992;&#35813; Ruby &#29256;&#26412;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">local&#65306;&#20026;&#26412;&#22320;&#30340;&#19968;&#20010;&#29305;&#23450;&#39033;&#30446;&#35774;&#32622; Ruby &#29256;&#26412;&#65292;&#27880;&#24847;&#36825;&#23558;&#35206;&#30422;&#20840;&#23616;&#35774;&#32622;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">shell&#65306;&#38024;&#23545; shell &#35774;&#32622; Ruby &#29256;&#26412;&#65292;&#35813;&#35774;&#32622;&#23558;&#35206;&#30422; global &#21644; local &#35774;&#32622;&#12290;</span>

rbenv global <span style="color: #a45bad;">1.9.3-p392</span>      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#40664;&#35748;&#20351;&#29992; 1.9.3-p392</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rbenv shell 1.9.3-p392       # &#24403;&#21069;&#30340; shell &#20351;&#29992; 1.9.3-p392, &#20250;&#35774;&#32622;&#19968;&#20010; `RBENV_VERSION` &#29615;&#22659;&#21464;&#37327;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">rbenv local jruby-1.7.3      # &#24403;&#21069;&#30446;&#24405;&#20351;&#29992; jruby-1.7.3, &#20250;&#29983;&#25104;&#19968;&#20010; `.rbenv-version` &#25991;&#20214;</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ruby &#37197;&#32622;</span>
$<span style="color: #7590db;">XCFG</span>/lang/ruby/linkruby.sh

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#25554;&#20214;</span>
gem update --system
gem install bundler
gem install rails
</pre>
</div>
</div>
</div>
